## 데이터 프레임 데이터 조작

- 데이터 갯수 세기

In [116]:
import pandas as pd 
import numpy as np

In [117]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [118]:
s.count()
# 데이터 갯수 세기는 count 메서드를 사용한다. NaN 값은 세지 않는다.

9

In [119]:
# rand: 0부터 1사이의 균일 분포

# randn: 표준 정규 분포

# randint: 균일 분포의 정수 난수

In [120]:
# np.random.randint(low, high=None, size=None)
# 최댓값 high 미입력시 0~low(최솟값) 사이의 숫자 출력

In [121]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float) 

df.iloc[2,3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [122]:
df.count()
#데이터프레임에서는 각 "열"마다 별도로 데이터 갯수를 센다.
#데이터에서 값이 누락된 부분을 찾을 때 유용하다.

0    4
1    4
2    4
3    3
dtype: int64

In [123]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [124]:
titanic.count()
#데이터프레임에서는 각 "열"마다 별도로 데이터 갯수를 센다.

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기 : value_counts()

1. 시리즈의 값이 정수, 문자열, 카테고리 값인 경우에는 value_counts 메서드로 각각의 값이 나온 횟수를 셀 수 있다.

2. 데이터프레임에는 value_counts 메서드가 없으므로 각 열마다 별도로 적용해야 한다.

ex. df\[0].value_counts()

In [125]:
titanic.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

In [126]:
titanic['sex'].value_counts()  #각각의 값이 나온 횟수를 셀 수 있다.
#titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

- 정렬

sort_index : 인덱스 값을 기준으로,

sort_values : 데이터 값을 기준으로 정렬한다.

In [127]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [128]:
df[0]

0    0.0
1    3.0
2    3.0
3    4.0
Name: 0, dtype: float64

In [129]:
df[0].sort_values()  #오름차순 , 데이터 값을 기준으로 정렬

0    0.0
1    3.0
2    3.0
3    4.0
Name: 0, dtype: float64

In [130]:
df[0].sort_values(ascending=False)  #내림차순 , 데이터 값을 기준으로 정렬

3    4.0
2    3.0
1    3.0
0    0.0
Name: 0, dtype: float64

In [131]:
df[3].sort_values()

#같은 값이면 인덱스가 앞에 있는 것이 위로 오고, NaN는 제일 마지막에

1    1.0
0    2.0
3    2.0
2    NaN
Name: 3, dtype: float64

In [132]:
df.sort_values(by=0)
# "데이터프레임"에서 sort_values 메서드를 사용하려면
# by 인수로 정렬 기준이 되는 "열"을 지정해 주어야 한다

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [133]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [134]:
titanic['embarked'].value_counts()  #embarked 열에서 각 요소가 나온 횟수를 알 수 있다.

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [135]:
titanic['embarked'].sort_index()  #인덱스 값 기준 정렬

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: embarked, Length: 891, dtype: object

- 행/열 합계

In [136]:
np.random.seed(2021)

df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  4  5  9  0  6  5  8  6
1  6  6  6  1  5  7  1  1
2  5  2  0  3  1  0  2  6
3  4  8  5  1  6  7  5  6

In [137]:
df2.sum(axis=1) #옆(열)방향 동작

0    43
1    33
2    19
3    42
dtype: int64

In [138]:
df2['RowSum'] = df2.sum(axis=1)   #새로운 칼럼 추가

In [139]:
df2

   0  1  2  3  4  5  6  7  RowSum
0  4  5  9  0  6  5  8  6      43
1  6  6  6  1  5  7  1  1      33
2  5  2  0  3  1  0  2  6      19
3  4  8  5  1  6  7  5  6      42

In [140]:
df2.sum()

0          19
1          21
2          20
3           5
4          18
5          19
6          16
7          19
RowSum    137
dtype: int64

In [141]:
df2.mean()

0          4.75
1          5.25
2          5.00
3          1.25
4          4.50
5          4.75
6          4.00
7          4.75
RowSum    34.25
dtype: float64

In [142]:
df2.std()

0          0.957427
1          2.500000
2          3.741657
3          1.258306
4          2.380476
5          3.304038
6          3.162278
7          2.500000
RowSum    11.116804
dtype: float64

In [143]:
df2.describe()   #요약 통계

,0,1,2,3,4,5,6,7,RowSum
count,4.000000,4.00,4.000000,4.000000,4.000000,4.000000,4.000000,4.00,4.000000
mean,4.750000,5.25,5.000000,1.250000,4.500000,4.750000,4.000000,4.75,34.250000
std,0.957427,2.50,3.741657,1.258306,2.380476,3.304038,3.162278,2.50,11.116804
min,4.000000,2.00,0.000000,0.000000,1.000000,0.000000,1.000000,1.00,19.000000
25%,4.000000,4.25,3.750000,0.750000,4.000000,3.750000,1.750000,4.75,29.500000
50%,4.500000,5.50,5.500000,1.000000,5.500000,6.000000,3.500000,6.00,37.500000
75%,5.250000,6.50,6.750000,1.500000,6.000000,7.000000,5.750000,6.00,42.250000
max,6.000000,8.00,9.000000,3.000000,6.000000,7.000000,8.000000,6.00,43.000000

- apply 변환

In [144]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [145]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [146]:
df3.apply(lambda x: x.max() - x.min(), axis=1)
#행에 대해 적용하고 싶으면 axis=1 인수를 쓴다.

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [147]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [148]:
titanic['adult/child'] = titanic.apply( lambda r: 'adult' if r['age'] >= 20 else 'child', axis=1)
# axis=1 : 열방향 동작 , 각 행의 모든 열에 대해서 동작

titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

- fillna : NaN 값은 fillna 메서드를 사용하여 원하는 값으로 바꿀 수 있다.

In [149]:
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [150]:
#데이터프레임에는 value_counts 메서드가 없으므로 각 열마다 별도로 적용해야 한다.
df3['A'].value_counts()
df3['B'].value_counts()
df3['C'].value_counts()

4    2
5    1
2    1
1    1
Name: C, dtype: int64

In [151]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [152]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [153]:
df3.apply(pd.value_counts).fillna('결')

   A  B  C
1  1  1  1
2  결  2  1
3  2  2  결
4  2  결  2
5  결  결  1

참고)

- NaN 처리방법

1. 평균값 대체

2. 중앙값 대체

3. 버림

- astype 메소드 : 전체 데이터의 자료형을 바꾸기

In [154]:
df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

- 실수 값을 카테고리 값으로 변환

cut: 실수 값의 경계선을 지정하는 경우

qcut: 갯수가 똑같은 구간으로 나누는 경우

In [155]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [156]:
bins = [1, 20, 30, 50, 70, 100]  #카테고리를 나누는 기준값
labels = ["미성년자", "청년", "중년", "장년", "노년"]

cats = pd.cut(ages, bins, labels=labels)
cats

#cut: 실수 값의 경계선을 지정하는 경우
#qcut: 갯수가 똑같은 구간으로 나누는 경우

#cut 명령이 반환하는 값은 Categorical 클래스 객체이다.
#이 객체는 categories 속성으로 라벨 문자열을, codes 속성으로 정수로 인코딩한 카테고리 값을 가진다.

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [157]:
cats[8]

'미성년자'

In [158]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [159]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [160]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [163]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
#다음 코드는 1000개의 데이터를 4개의 구간으로 나누는데 각 구간은 250개씩의 데이터를 가진다.

In [165]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64